Catalogs/НастройкиПодключенияКОнлайнЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключенияКОнлайнЗаказам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаСинхронизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоРеквизитамОтФизЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоРеквизитамОтЮрЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключенияКОблачнойКассе</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКОблачнымКассам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискализироватьОнлайнЗаказы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыОплатыОнлайнЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкаПодключения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиПодключенияКСистемеБыстрыхПлатежей</v8:Type>
								<v8:Type>cfg:CatalogRef.НастройкиПодключенияКИнтернетЭквайрингу</v8:Type>
								<v8:Type>cfg:CatalogRef.НастройкиПодключенияКПлатежнымСистемам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпособыОплатыОнлайнЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыОплатыОнлайнЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СБПc2b</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПb2b</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРеквизитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Эквайринг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнтернетЭквайринг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОзонПэй</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиПодключенияКОнлайнЗаказам/Forms/ФормаЭлемента/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	Для Каждого НастройкаОплаты Из Объект.НастройкиОплаты Цикл
		Если НастройкаОплаты.СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.СБПc2b Тогда
			НастройкаПодключенияКСБПc2b = НастройкаОплаты.НастройкаПодключения;
			ПриниматьОплатуСБПc2b = НастройкаОплаты.Используется;
		ИначеЕсли НастройкаОплаты.СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.СБПb2b Тогда
			НастройкаПодключенияКСБПb2b = НастройкаОплаты.НастройкаПодключения;
			ПриниматьОплатуСБПb2b = НастройкаОплаты.Используется;
		ИначеЕсли НастройкаОплаты.СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.Эквайринг Тогда
			НастройкаПодключенияКИнтернетЭквайрингу = НастройкаОплаты.НастройкаПодключения;
			ПриниматьОплатуИнтернетЭквайринг = НастройкаОплаты.Используется;
		ИначеЕсли НастройкаОплаты.СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.ОзонПэй Тогда
			НастройкаПодключенияКОзонПэй = НастройкаОплаты.НастройкаПодключения;
			ПриниматьОплатуОзонПэй = НастройкаОплаты.Используется;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.Используется = Истина;
		Объект.ПоРеквизитамОтФизЛиц = Истина;
		Объект.ПоРеквизитамОтЮрЛиц = Истина;
		
		Если ЗначениеЗаполнено(Объект.Организация)
			И ПустаяСтрока(Объект.Наименование) Тогда
			Объект.Наименование = Строка(Объект.Организация);
		КонецЕсли;
		
		ЭтоНоваяНастройка = Истина;
		
	КонецЕсли;
	
	НеактуальныеНастройки = Новый ФиксированноеСоответствие(Новый Соответствие);
	
	НастройкаОнлайнЗаказовДоступна = ОнлайнЗаказыСлужебный.НастройкаОнлайнЗаказовДоступна();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.БазоваяФункциональностьПлатежныхСистем") Тогда
		МодульПлатежныеСистемыСлужебный = ОбщегоНазначения.ОбщийМодуль("ПлатежныеСистемыСлужебный");
		ЧтениеНастроекПлатежныхСистемДоступно = МодульПлатежныеСистемыСлужебный.ЧтениеНастроекДоступно();
	КонецЕсли;
	
	Если Параметры.ЗапретИзмененияОрганизации Тогда
		Элементы.Организация.Вид = ВидПоляФормы.ПолеНадписи;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	УправлениеЭлементамиФормыПоДанным();
	УстановитьДоступностьНастроекОплатФискализации();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ПриниматьОплатуСБПc2b
		И Не ЗначениеЗаполнено(НастройкаПодключенияКСБПc2b) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не заполнена настройка подключения к СБП.'"),
			,
			"НастройкаПодключенияКСБПc2b",
			,
			Отказ);
		
	КонецЕсли;
	
	Если ПриниматьОплатуИнтернетЭквайринг
		И Не ЗначениеЗаполнено(НастройкаПодключенияКИнтернетЭквайрингу) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не заполнена настройка подключения к Интернет-эквайрингу.'"),
			,
			"НастройкаПодключенияКИнтернетЭквайрингу",
			,
			Отказ);
		
	КонецЕсли;
	
	Если ПриниматьОплатуОзонПэй
		И Не ЗначениеЗаполнено(НастройкаПодключенияКОзонПэй) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не заполнена настройка подключения к Ozon Pay.'"),
			,
			"НастройкаПодключенияКОзонПэй",
			,
			Отказ);
		
	КонецЕсли;
	
	Если Объект.ФискализироватьОнлайнЗаказы
		И Не ЗначениеЗаполнено(Объект.НастройкаПодключенияКОблачнойКассе) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не заполнена настройка облачной кассы.'"),
			,
			"Объект.НастройкаПодключенияКОблачнойКассе",
			,
			Отказ);
		
	КонецЕсли;
	
	Если ПриниматьОплатуСБПb2b
		И Не ЗначениеЗаполнено(НастройкаПодключенияКСБПb2b) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не заполнена настройка подключения к СБП.'"),
			,
			"НастройкаПодключенияКСБПb2b",
			,
			Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НеобходимОтзывТокенов = Объект.ОшибкаСинхронизации;
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		ПроверитьАктуальностьНастроек();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	РезультатПроверкиШаблонов = Неопределено;
	ИспользоватьШаблоныСообщений = ОнлайнЗаказыСлужебный.ИспользоватьШаблоныСообщений();
	
	Если ИспользоватьШаблоныСообщений Тогда
		РезультатПроверкиШаблонов = ОнлайнЗаказыСлужебный.ВсеШаблоныСозданы();
	КонецЕсли;
	
	Если ИзменениеАктуальности Тогда
		ИзменениеАктуальности = Ложь;
		УправлениеЭлементамиФормыПоДанным();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗакрытьПослеЗаписи", Ложь);
	ДополнительныеПараметры.Вставить("ВыполнитьОбработкуЗавершенияОперацииСТокенами", Истина);
	ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, ПараметрыЗаписи);
	
	Если ОписаниеОповещенияОЗакрытии <> Неопределено
		И ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры <> Неопределено Тогда
		ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Вставить(
			"НастройкаПодключенияКОнлайнЗаказам",
			Объект.Ссылка);
		ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Вставить(
			"ИзмененыНастройкиСтраницы",
			ИзмененыНастройкиСтраницы);
	КонецЕсли;
	
	Если НеобходимОтзывТокенов Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Выполняется отзыв неиспользуемых токенов.'");
		
		РезультатВыполнения = ОтозватьТокеныЗапускЗадания();
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения(
			"ОтозватьТокеныЗавершение",
			ЭтотОбъект,
			ДополнительныеПараметры);
		
		Если РезультатВыполнения = Неопределено
			Или РезультатВыполнения.Статус = "Выполнено"
			Или РезультатВыполнения.Статус = "Ошибка" Тогда
			
			ОтозватьТокеныЗавершение(РезультатВыполнения, ДополнительныеПараметры);
			Возврат;
			
		КонецЕсли;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			РезультатВыполнения,
			ОповещениеОЗавершении,
			ПараметрыОжидания);
		
	ИначеЕсли ДополнительныеПараметры.ВыполнитьОбработкуЗавершенияОперацииСТокенами Тогда
		ПослеЗавершенияОперацийСТокенами(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПредставлениеНеРедактировалось = Объект.Наименование = Строка(Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ПредставлениеНеРедактировалось Тогда
		Объект.Наименование = Строка(Объект.Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПредупреждениеОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "operation:pageSettings" Тогда
		ОбновитьНастройкуВСервисе(Ложь, Истина);
	КонецЕсли;
	
КонецПроцедуры

#Область ОплатаСБПc2b

&НаКлиенте
Процедура ПриниматьОплатуСБПc2bПриИзменении(Элемент)
	
	УстановитьИспользованиеСпособаОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПc2b"),
		ПриниматьОплатуСБПc2b);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКСБПc2bПриИзменении(Элемент)
	
	ПриИзмененииНастройкиОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПc2b"),
		НастройкаПодключенияКСБПc2b);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКСБПc2bНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОнлайнЗаказыКлиентСобытия.ПриВыбореНастройкиПодключения(
		ЭтотОбъект,
		Новый ОписаниеОповещения("ПослеВыбораНастройкиПодключенияСБПc2b", ЭтотОбъект),
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПc2b"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКСБПc2bСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем") Тогда
		Возврат;
	КонецЕсли;
	
	ОнлайнЗаказыКлиентСобытия.ПриПодключенииПлатежнойСистемы(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПc2b"),
		Новый ОписаниеОповещения(
			"СозданиеНастройкиПодключенияКСБПc2bЗавершение",
			ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область ИнтернетЭквайринг

&НаКлиенте
Процедура ПриниматьОплатуИнтернетЭквайрингПриИзменении(Элемент)
	
	УстановитьИспользованиеСпособаОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.Эквайринг"),
		ПриниматьОплатуИнтернетЭквайринг);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКИнтернетЭквайрингуПриИзменении(Элемент)
	
	ПриИзмененииНастройкиОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.Эквайринг"),
		НастройкаПодключенияКИнтернетЭквайрингу);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКИнтернетЭквайрингуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОнлайнЗаказыКлиентСобытия.ПриВыбореНастройкиПодключения(
		ЭтотОбъект,
		Новый ОписаниеОповещения("ПослеВыбораНастройкиПодключенияИнтернетЭквайринга", ЭтотОбъект),
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.Эквайринг"))
		
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКИнтернетЭквайрингуСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем") Тогда
		Возврат;
	КонецЕсли;
	
	ОнлайнЗаказыКлиентСобытия.ПриПодключенииПлатежнойСистемы(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.Эквайринг"),
		Новый ОписаниеОповещения(
			"СозданиеНастройкиПодключенияКИнтернетЭквайрингуЗавершение",
			ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область ОзонПэй

&НаКлиенте
Процедура ПриниматьОплатуОзонПэйПриИзменении(Элемент)
	
	УстановитьИспользованиеСпособаОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ОзонПэй"),
		ПриниматьОплатуОзонПэй);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКОзонПэйПриИзменении(Элемент)
	
	ПриИзмененииНастройкиОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ОзонПэй"),
		НастройкаПодключенияКОзонПэй);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКОзонПэйНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОнлайнЗаказыКлиентСобытия.ПриВыбореНастройкиПодключения(
		ЭтотОбъект,
		Новый ОписаниеОповещения("ПослеВыбораНастройкиПодключенияОзонПэй", ЭтотОбъект),
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ОзонПэй"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКОзонПэйСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем") Тогда
		Возврат;
	КонецЕсли;
	
	ОнлайнЗаказыКлиентСобытия.ПриПодключенииПлатежнойСистемы(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ОзонПэй"),
		Новый ОписаниеОповещения(
			"СозданиеНастройкиПодключенияКОзонПэйЗавершение",
			ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область ПоРеквизитам

&НаКлиенте
Процедура ПоРеквизитамОтФизЛицПриИзменении(Элемент)
	
	ПослеИзмененияИспользованияОплатФискализации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоРеквизитамОтЮрЛицПриИзменении(Элемент)
	
	ПослеИзмененияИспользованияОплатФискализации();
	
КонецПроцедуры

#КонецОбласти

#Область ОплатаСБПb2b

&НаКлиенте
Процедура ПриниматьОплатуСБПb2bПриИзменении(Элемент)
	
	УстановитьИспользованиеСпособаОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПb2b"),
		ПриниматьОплатуСБПb2b);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКСБПb2bПриИзменении(Элемент)
	
	ПриИзмененииНастройкиОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПb2b"),
		НастройкаПодключенияКСБПb2b);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКСБПb2bНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОнлайнЗаказыКлиентСобытия.ПриВыбореНастройкиПодключения(
		ЭтотОбъект,
		Новый ОписаниеОповещения("ПослеВыбораНастройкиПодключенияСБПb2b", ЭтотОбъект),
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПb2b"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКСБПb2bСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем") Тогда
		Возврат;
	КонецЕсли;
	
	ОнлайнЗаказыКлиентСобытия.ПриПодключенииПлатежнойСистемы(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПb2b"),
		Новый ОписаниеОповещения(
			"СозданиеНастройкиПодключенияКСБПb2bЗавершение",
			ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область ОблачнаяКасса

&НаКлиенте
Процедура ФискализироватьОнлайнЗаказыПриИзменении(Элемент)
	
	ПослеИзмененияИспользованияОплатФискализации();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКОблачнойКассеПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКОблачнойКассеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОнлайнЗаказыКлиентСобытия.ПриВыбореОблачнойКассы(
		ЭтотОбъект,
		Новый ОписаниеОповещения("ПослеВыбораНастройкиПодключенияКОблачнойКассе", ЭтотОбъект),
		Объект.Организация);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Записать(Новый Структура("ЗакрытьПослеЗаписи", Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСтраницуЗаказа(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗадатьВопросОЗаписи("ВнешнийВидСтраницы", Неопределено);
	Иначе
		НастроитьВнешнийВидСтраницы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВСервис(Команда)
	
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Перед обновлением настроек в сервисе необходимо записать изменения.'"));
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Необходимо записать настройку подключения.'"));
		Возврат;
	КонецЕсли;
	
	ОбновитьНастройкуВСервисе(Ложь, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВыборНастройки

&НаКлиенте
Процедура ЗадатьВопросОЗаписи(ВидНастройки, НавигационнаяСсылка = Неопределено)
	
	Оповещение = Новый ОписаниеОповещения(
		"ПослеОтветаНаВопросОЗаписи",
		ЭтотОбъект,
		Новый Структура(
			"ВидОбрабатываемойНастройки, НавигационнаяСсылка",
			ВидНастройки,
			НавигационнаяСсылка));
			
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, "Записать");
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
	
	ПоказатьВопрос(
		Оповещение,
		НСтр("ru = 'Для продолжения необходимо записать настройку подключения.'"),
		Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОЗаписи(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Записать();
		
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Возврат;
		КонецЕсли;
		
		Если Параметры.ВидОбрабатываемойНастройки = "ВнешнийВидСтраницы" Тогда
			НастроитьВнешнийВидСтраницы();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СпособыОплаты

&НаСервере
Процедура ПослеИзмененияИспользованияОплатФискализации()
	
	УстановитьДоступностьНастроекОплатФискализации();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИспользованиеСпособаОплаты(СпособОплаты, Использование)
	
	Модифицированность = Истина;
	
	Отбор = Новый Структура;
	Отбор.Вставить("СпособОплаты", СпособОплаты);
	
	НайденныеЗначения = Объект.НастройкиОплаты.НайтиСтроки(Отбор);
	
	Для Каждого НайденноеЗначение Из НайденныеЗначения Цикл
		
		НайденноеЗначение.Используется = Использование;
		
	КонецЦикла;
	
	ПослеИзмененияИспользованияОплатФискализации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНастройкиОплаты(СпособОплаты, НоваяНастройкаОплаты)
	
	Модифицированность = Истина;
	
	Отбор = Новый Структура;
	Отбор.Вставить("СпособОплаты", СпособОплаты);
	
	НайденныеЗначения = Объект.НастройкиОплаты.НайтиСтроки(Отбор);
	
	Для Каждого НайденноеЗначение Из НайденныеЗначения Цикл
		
		Если ЗначениеЗаполнено(НоваяНастройкаОплаты) Тогда
			НайденноеЗначение.НастройкаПодключения = НоваяНастройкаОплаты;
		Иначе
			Объект.НастройкиОплаты.Удалить(НайденноеЗначение);
		КонецЕсли;
		
	КонецЦикла;
	
	Если НайденныеЗначения.Количество() = 0
		И ЗначениеЗаполнено(НоваяНастройкаОплаты) Тогда
		НастройкаОплаты = Объект.НастройкиОплаты.Добавить();
		НастройкаОплаты.СпособОплаты = СпособОплаты;
		НастройкаОплаты.НастройкаПодключения = НоваяНастройкаОплаты;
		НастройкаОплаты.Используется = Истина;
	КонецЕсли;
	
	ПослеИзмененияИспользованияОплатФискализации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНастройкиПодключенияСБПc2b(
		НастройкаПодключения,
		ДополнительныеПараметры) Экспорт
	
	Если НастройкаПодключения <> Неопределено Тогда
		
		НастройкаПодключенияКСБПc2b = НастройкаПодключения;
		
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПc2b"),
			НастройкаПодключения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНастройкиПодключенияИнтернетЭквайринга(
		НастройкаПодключения,
		ДополнительныеПараметры) Экспорт
	
	Если НастройкаПодключения <> Неопределено Тогда
		
		НастройкаПодключенияКИнтернетЭквайрингу = НастройкаПодключения;
		
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.Эквайринг"),
			НастройкаПодключения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНастройкиПодключенияОзонПэй(
		НастройкаПодключения,
		ДополнительныеПараметры) Экспорт
	
	Если НастройкаПодключения <> Неопределено Тогда
		
		НастройкаПодключенияКОзонПэй = НастройкаПодключения;
		
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ОзонПэй"),
			НастройкаПодключения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНастройкиПодключенияСБПb2b(
		НастройкаПодключения,
		ДополнительныеПараметры) Экспорт
	
	Если НастройкаПодключения <> Неопределено Тогда
		
		НастройкаПодключенияКСБПb2b = НастройкаПодключения;
		
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПb2b"),
			НастройкаПодключения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеНастройкиПодключенияКСБПc2bЗавершение(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		НастройкаПодключенияКСБПc2b = Результат;
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПc2b"),
			НастройкаПодключенияКСБПc2b);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеНастройкиПодключенияКИнтернетЭквайрингуЗавершение(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		НастройкаПодключенияКИнтернетЭквайрингу = Результат;
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.Эквайринг"),
			НастройкаПодключенияКИнтернетЭквайрингу);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеНастройкиПодключенияКОзонПэйЗавершение(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		НастройкаПодключенияКОзонПэй = Результат;
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ОзонПэй"),
			НастройкаПодключенияКОзонПэй);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеНастройкиПодключенияКСБПb2bЗавершение(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		НастройкаПодключенияКСБПb2b = Результат;
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПb2b"),
			НастройкаПодключенияКСБПb2b);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОблачнаяКасса

&НаКлиенте
Процедура ПослеВыбораНастройкиПодключенияКОблачнойКассе(
		НастройкаПодключения,
		ДополнительныеПараметры) Экспорт
	
	Если НастройкаПодключения <> Неопределено Тогда
		Модифицированность = Истина;
		Объект.НастройкаПодключенияКОблачнойКассе = НастройкаПодключения;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ШаблоныСообщений

&НаКлиенте
Процедура ПослеОтветаНаВопросОСозданииШаблонов(Результат, Параметры) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗакрытьПослеЗаписи", Ложь);
	ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, Параметры);
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		СозданныеШаблоны = СоздатьПредопределенныеШаблоныСообщений();
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			РезультатПроверкиШаблонов.Шаблоны,
			СозданныеШаблоны);
		РезультатПроверкиШаблонов.ВсеШаблоны = Истина;
		
		Если Не ДополнительныеПараметры.ЗакрытьПослеЗаписи Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Предопределенные шаблоны созданы.'"));
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьНастройкуВСервисе(
		ДополнительныеПараметры.ЗакрытьПослеЗаписи,
		Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьПредопределенныеШаблоныСообщений()
	
	ОнлайнЗаказыСлужебный.УстановитьИспользованиеШаблоновСообщенийПроверкаПодсистем();
	Возврат ОнлайнЗаказыСлужебный.СоздатьПредопределенныеШаблоныСообщенийПроверкаПодсистем();
	
КонецФункции

#КонецОбласти

#Область ОтзывТокенов

&НаСервере
Функция СуществуютНастройки(ВидТокена, НастройкаПодключения)
	
	Если ВидТокена = ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаПриемОплат() Тогда
		Возврат Справочники.НастройкиПодключенияКОнлайнЗаказам.СуществуютНастройкиПоНастройкеОплаты(
			НастройкаПодключения,
			Объект.Ссылка)
	ИначеЕсли ВидТокена = ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаОблачнаяКасса() Тогда
		Возврат Справочники.НастройкиПодключенияКОнлайнЗаказам.СуществуютНастройкиПоОблачнойКассе(
			НастройкаПодключения,
			Объект.Ссылка)
	КонецЕсли
	
КонецФункции

&НаСервере
Функция ОтозватьТокеныЗапускЗадания()
	
	НеиспользуемыеНастройки = Справочники.НастройкиПодключенияКОнлайнЗаказам.НеиспользуемыеНастройки(
		Объект.Ссылка);
	
	Если Не ЗначениеЗаполнено(НеиспользуемыеНастройки[ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаПриемОплат()])
		И Не ЗначениеЗаполнено(НеиспользуемыеНастройки[ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаОблачнаяКасса()]) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(
		УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Отзыв неиспользуемых токенов онлайн-заказов.'");
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ОнлайнЗаказыСлужебный.ОтозватьНеиспользуемыеТокеныНастройкиПодключения",
		НеиспользуемыеНастройки);
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ОтозватьТокеныЗавершение(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ПослеЗавершенияОперацийСТокенами(ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатОперации = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
			Оповещение = Новый ОписаниеОповещения(
				"ПослеОтветаНаВопросОПовторномОтзывеТокенов",
				ЭтотОбъект,
				ДополнительныеПараметры);
			ПоказатьВопрос(
				Оповещение,
				НСтр("ru = 'При отзыве токенов возникла ошибка. Повторить попытку?'"),
				РежимДиалогаВопрос.ДаНетОтмена);
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Оповещение = Новый ОписаниеОповещения(
			"ПослеОтветаНаВопросОПовторномОтзывеТокенов",
			ЭтотОбъект,
			ДополнительныеПараметры);
		ПоказатьВопрос(
			Оповещение,
			НСтр("ru = 'При отзыве токенов возникла ошибка. Повторить попытку?'"),
			РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
	ПослеЗавершенияОперацийСТокенами(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОПовторномОтзывеТокенов(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОтозватьТокеныЗапускЗадания();
		Возврат;
	КонецЕсли;
	
	ПослеЗавершенияОперацийСТокенами(Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияОперацийСТокенами(ДополнительныеПараметры)
	
	Если РезультатПроверкиШаблонов <> Неопределено
		И Не РезультатПроверкиШаблонов.ВсеШаблоны Тогда
		
		Оповещение = Новый ОписаниеОповещения(
			"ПослеОтветаНаВопросОСозданииШаблонов",
			ЭтотОбъект,
			ДополнительныеПараметры);
		
		ПоказатьВопрос(
			Оповещение,
			НСтр("ru = 'Создать шаблоны сообщений для автоматического заполнения на основании данных документов?'"),
			РежимДиалогаВопрос.ДаНет);
			
	Иначе
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ОбновитьНастройкуВСервисе(
				ДополнительныеПараметры.ЗакрытьПослеЗаписи,
				Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеНастройкиВСервисе

&НаКлиенте
Процедура ОбновитьНастройкуВСервисе(
	ЗакрытьПослеЗаписи,
	ПоказыватьПредупреждение)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗакрытьПослеЗаписи", ЗакрытьПослеЗаписи);
	ДополнительныеПараметры.Вставить("ПоказыватьПредупреждение", ПоказыватьПредупреждение);
	
	Если Объект.ОшибкаСинхронизации Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Ревизия токенов и обновление настройки онлайн-заказов в сервисе.'");
		
		РезультатВыполнения = ОбновитьНастройкуВСервисеСРевизиейТокеновЗапускЗадания();
		
	ИначеЕсли ЗначениеЗаполнено(НеактуальныеНастройки) Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Отзыв токенов и обновление настройки онлайн-заказов в сервисе.'");
		
		РезультатВыполнения = ОбновитьНастройкуВСервисеСОтзывомТокеновЗапускЗадания();
		
	Иначе
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Обновление настройки онлайн-заказов в сервисе.'");
		
		РезультатВыполнения = ОбновитьНастройкуВСервисеЗапускЗадания();
		
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ОбновитьНастройкуВСервисеЗавершение",
		ЭтотОбъект,
		ДополнительныеПараметры);
		
	Если РезультатВыполнения.Статус = "Выполнено" Или РезультатВыполнения.Статус = "Ошибка" Тогда
		ОбновитьНастройкуВСервисеЗавершение(
			РезультатВыполнения,
			ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		РезультатВыполнения,
		ОповещениеОЗавершении,
		ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ОбновитьНастройкуВСервисеСРевизиейТокеновЗапускЗадания()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(
		УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания
		= НСтр("ru = 'Ревизия токенов и обновление настройки онлайн-заказов в сервисе.'");
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ОнлайнЗаказыСлужебный.ОбновитьНастройкуСРевизиейТокенов",
		Объект.Ссылка,
		ЭтоНоваяНастройка);
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервере
Функция ОбновитьНастройкуВСервисеСОтзывомТокеновЗапускЗадания()
	
	НеиспользуемыеНастройкиОплат = Новый Соответствие;
	НеиспользуемыеНастройкиОблачныхКасс = Новый Соответствие;
	
	Для Каждого НеактуальнаяНастройка Из НеактуальныеНастройки Цикл
		
		Если СуществуютНастройки(НеактуальнаяНастройка.Значение.ВидТокена, НеактуальнаяНастройка.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НеактуальнаяНастройка.Значение.ВидТокена =
			ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаПриемОплат() Тогда
			
			НеиспользуемыеНастройкиОплат.Вставить(
				НеактуальнаяНастройка.Значение.СпособОплаты,
				НеактуальнаяНастройка.Ключ);
			
		ИначеЕсли НеактуальнаяНастройка.Значение.ВидТокена =
				ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаОблачнаяКасса() Тогда
			
			НеиспользуемыеНастройкиОблачныхКасс.Вставить(
				НеактуальнаяНастройка.Значение.СпособОплаты,
				НеактуальнаяНастройка.Ключ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НеиспользуемыеНастройкиОплат)
		Или ЗначениеЗаполнено(НеиспользуемыеНастройкиОблачныхКасс) Тогда
		
		НеиспользуемыеНастройки = Новый Структура;
		НеиспользуемыеНастройки.Вставить(
			ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаПриемОплат(),
			НеиспользуемыеНастройкиОплат);
		НеиспользуемыеНастройки.Вставить(
			ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаОблачнаяКасса(),
			НеиспользуемыеНастройкиОблачныхКасс);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(
			УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания
			= НСтр("ru = 'Отзыв токенов и обновление настройки онлайн-заказов в сервисе.'");
		
		РезультатВыполнения = ДлительныеОперации.ВыполнитьФункцию(
			ПараметрыВыполнения,
			"ОнлайнЗаказыСлужебный.ОбновитьНастройкуСОтзывомТокенов",
			Объект.Ссылка,
			НеиспользуемыеНастройки,
			ЭтоНоваяНастройка);
		
	Иначе
		РезультатВыполнения = ОбновитьНастройкуВСервисеЗапускЗадания();
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервере
Функция ОбновитьНастройкуВСервисеЗапускЗадания()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(
		УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания
		= НСтр("ru = 'Обновление настроек онлайн-заказов в сервисе.'");
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ОнлайнЗаказыСлужебный.ОбновитьНастройку",
		Объект.Ссылка,
		ЭтоНоваяНастройка);
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНастройкуВСервисеЗавершение(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатОперации = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
			
			ПоказатьПредупреждение(
				Неопределено,
				РезультатОперации.СообщениеОбОшибке);
			
			Если Объект.ОшибкаСинхронизации <> Истина Тогда
				УстановитьОшибкуСинхронизации(Истина);
			КонецЕсли;
			
		Иначе
			
			Если Объект.ОшибкаСинхронизации <> Ложь Тогда
				УстановитьОшибкуСинхронизации(Ложь);
			КонецЕсли;
			
			ЭтоНоваяНастройка = Ложь;
			
			Если ДополнительныеПараметры.ПоказыватьПредупреждение Тогда
				ПоказатьПредупреждение(
					Неопределено,
					НСтр("ru = 'Настройки успешно обновлены.'"));
			ИначеЕсли ДополнительныеПараметры.ЗакрытьПослеЗаписи Тогда
				Закрыть(Истина);
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ДанныеОшибки = ОбщегоНазначенияКлиентСервер.УточнениеИсключения(
			Результат.ИнформацияОбОшибке,
			НСтр("ru = 'Ошибка обновления настройки онлайн-заказов в сервисе.'"));
		
		ПоказатьПредупреждение(
			Неопределено,
			ДанныеОшибки.Текст);
		
	КонецЕсли;
	
	Прочитать();
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаВнешнегоВидаСтраницы

&НаКлиенте
Процедура НастроитьВнешнийВидСтраницы()
	
	Результат = URLНастройкиПодключения(Объект.Ссылка);
	
	Если Результат.КодОшибки = ОнлайнЗаказыКлиент.КодОшибкиДанныеАутентификацииИППНеЗаполнены() Тогда
		Если ИнтернетПоддержкаПользователейКлиент.ДоступноПодключениеИнтернетПоддержки() Тогда
			ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(
				Новый ОписаниеОповещения("ПриЗавершенииПодключенияИнтернетПоддержки", ЭтотОбъект),
				ЭтотОбъект);
		Иначе
			ПоказатьПредупреждение(
				,
				НСтр("ru = 'Необходимо подключить Интернет-поддержку пользователей.
				|Обратитесь к администратору системы.'"));
		КонецЕсли;
	ИначеЕсли ПустаяСтрока(Результат.КодОшибки) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Результат.URLНастройкиПодключения);
	Иначе
		ПоказатьПредупреждение(
			,
			Результат.СообщениеОбОшибке);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция URLНастройкиПодключения(Знач НастройкаПодключения)
	
	Возврат ОнлайнЗаказыСлужебный.URLНастройкиПодключения(НастройкаПодключения);
	
КонецФункции

#КонецОбласти

#Область Прочее

&НаСервере
Процедура ПроверитьАктуальностьНастроек()
	
	НеактуальныеНастройкиВрем = Новый Соответствие;
	ИзмененыНастройкиОплатФискализации = Ложь;
	ИзмененыНастройкиСтраницы = Ложь;
	НастройкаОбъект = Объект.Ссылка.ПолучитьОбъект();
	
	Если Не Объект.ОшибкаСинхронизации Тогда
		НеобходимОтзывТокенов = Не Объект.Используется И НастройкаОбъект.Используется;
	КонецЕсли;
	
	ПроверитьАктуальностьНастроекФискализации(НастройкаОбъект, НеактуальныеНастройкиВрем);
	ПроверитьАктуальностьНастроекОплат(НастройкаОбъект, НеактуальныеНастройкиВрем);
	
	Если НастройкаОбъект.Используется <> Объект.Используется
		Или НастройкаОбъект.Наименование <> Объект.Наименование
		Или ИзмененыНастройкиОплатФискализации Тогда
		ИзмененыНастройкиСтраницы = Истина;
	КонецЕсли;
	
	НеактуальныеНастройки = Новый ФиксированноеСоответствие(НеактуальныеНастройкиВрем);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьАктуальностьНастроекФискализации(НастройкаОбъект, НеактуальныеНастройкиВрем)
	
	Если НастройкаОбъект.ФискализироватьОнлайнЗаказы <> Объект.ФискализироватьОнлайнЗаказы Тогда
		ИзмененыНастройкиОплатФискализации = Истина;
	КонецЕсли;
	
	НастройкаПодключенияКОблачнойКассеСохраненная = ?(
		НастройкаОбъект.ФискализироватьОнлайнЗаказы,
		НастройкаОбъект.НастройкаПодключенияКОблачнойКассе,
		Неопределено);
	
	НастройкаПодключенияКОблачнойКассе = ?(
		Объект.ФискализироватьОнлайнЗаказы,
		Объект.НастройкаПодключенияКОблачнойКассе,
		Неопределено);
	
	Если Объект.ФискализироватьОнлайнЗаказы
		И НастройкаПодключенияКОблачнойКассеСохраненная <> НастройкаПодключенияКОблачнойКассе Тогда
		ИзмененыНастройкиОплатФискализации = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкаПодключенияКОблачнойКассеСохраненная)
		И НастройкаПодключенияКОблачнойКассеСохраненная <> НастройкаПодключенияКОблачнойКассе Тогда
		
		НеактуальныеНастройкиВрем.Вставить(
			НастройкаПодключенияКОблачнойКассеСохраненная,
			ПараметрыНастройкиПодключения(
				ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаОблачнаяКасса(),
				Перечисления.СпособыОплатыОнлайнЗаказов.ПустаяСсылка()));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьАктуальностьНастроекОплат(НастройкаОбъект, НеактуальныеНастройкиВрем)
	
	Если НастройкаОбъект.ПоРеквизитамОтФизЛиц <> Объект.ПоРеквизитамОтФизЛиц
		Или НастройкаОбъект.ПоРеквизитамОтЮрЛиц <> Объект.ПоРеквизитамОтЮрЛиц Тогда
		ИзмененыНастройкиОплатФискализации = Истина;
	КонецЕсли;
	
	Если НастройкаОбъект.НастройкиОплаты.Количество() <> Объект.НастройкиОплаты.Количество() Тогда
		ИзмененыНастройкиОплатФискализации = Истина;
	КонецЕсли;
	
	Для Каждого СохраненнаяНастройкаОплаты Из НастройкаОбъект.НастройкиОплаты Цикл
		
		НастройкаОплаты = Неопределено;
		Используется = Ложь;
		
		Отбор = Новый Структура;
		Отбор.Вставить("СпособОплаты", СохраненнаяНастройкаОплаты.СпособОплаты);
		
		НайденныеЗначения = Объект.НастройкиОплаты.НайтиСтроки(Отбор);
		
		Для Каждого НайденноеЗначение Из НайденныеЗначения Цикл
			НастройкаОплаты = НайденноеЗначение.НастройкаПодключения;
			Используется = НайденноеЗначение.Используется;
		КонецЦикла;
		
		Если СохраненнаяНастройкаОплаты.Используется <> Используется Тогда
			ИзмененыНастройкиОплатФискализации = Истина;
		ИначеЕсли Используется
			И СохраненнаяНастройкаОплаты.НастройкаПодключения <> НастройкаОплаты Тогда
			ИзмененыНастройкиОплатФискализации = Истина;
		КонецЕсли;
		
		Если НастройкаНеактуальна(СохраненнаяНастройкаОплаты, НастройкаОплаты, Используется) Тогда
			НеактуальныеНастройкиВрем.Вставить(
				СохраненнаяНастройкаОплаты.НастройкаПодключения,
				ПараметрыНастройкиПодключения(
					ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаПриемОплат(),
					СохраненнаяНастройкаОплаты.СпособОплаты));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НастройкаНеактуальна(СохраненнаяНастройкаОплаты, НастройкаОплаты, Используется)
	
	Если СохраненнаяНастройкаОплаты.Используется = Ложь
		И Используется = Ложь Тогда
		Возврат Ложь;
	ИначеЕсли СохраненнаяНастройкаОплаты.Используется И Не Используется Тогда
		Возврат Истина;
	ИначеЕсли СохраненнаяНастройкаОплаты.Используется
		И СохраненнаяНастройкаОплаты.НастройкаПодключения <> НастройкаОплаты Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПараметрыНастройкиПодключения(
	ВидТокена,
	СпособОплаты)
	
	Результат = Новый Структура;
	Результат.Вставить("ВидТокена", ВидТокена);
	Результат.Вставить("СпособОплаты", СпособОплаты);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.НастроитьСтраницуЗаказа.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ФормаОбновитьНастройки.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ФормаЗаписатьИЗакрыть.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ГруппаПодключениеКСБПc2b.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ГруппаПодключениеЭквайринг.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ГруппаПодключениеОзонПэй.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ГруппаПоБанковскимРеквизитамФизЛица.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ГруппаПодключениеКОблачнойКассе.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ГруппаПодключениеКСБПb2b.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ГруппаПоБанковскимРеквизитамЮрЛица.Доступность = НастройкаОнлайнЗаказовДоступна;
	
	Если Параметры.РежимФормы = "ОтправкаURLОнлайнЗаказов" Тогда
		Элементы.Используется.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьПредставлениеСБП();
	УстановитьВидимостьПредставлениеИнтернетЭквайринга();
	УстановитьВидимостьПредставлениеОблачнойФискализации();
	УстановитьПредставлениеДекорацииПредупреждение();
	УстановитьВидимостьПредставлениеОзонПэй();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормыПоДанным()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ГруппаПредупреждение.Видимость = Объект.ОшибкаСинхронизации;
	Иначе
		Элементы.ГруппаПредупреждение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьНастроекОплатФискализации()
	
	Элементы.НастройкаПодключенияКСБПc2b.Доступность = ПриниматьОплатуСБПc2b;
	Элементы.НастройкаПодключенияКОзонПэй.Доступность = ПриниматьОплатуОзонПэй;
	Элементы.НастройкаПодключенияКИнтернетЭквайрингу.Доступность = ПриниматьОплатуИнтернетЭквайринг;
	Элементы.НастройкаПодключенияКОблачнойКассе.Доступность = Объект.ФискализироватьОнлайнЗаказы;
	
	Элементы.НастройкаПодключенияКСБПb2b.Доступность = ПриниматьОплатуСБПb2b;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПредставлениеСБП()
	
	ЧтениеНастроекСБПДоступно = Ложь;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.БазоваяФункциональностьСБП") Тогда
		МодульСистемаБыстрыхПлатежейСлужебный = ОбщегоНазначения.ОбщийМодуль("СистемаБыстрыхПлатежейСлужебный");
		ЧтениеНастроекСБПДоступно = МодульСистемаБыстрыхПлатежейСлужебный.ЧтениеНастроекДоступно();
	КонецЕсли;
	
	Если Не ЧтениеНастроекСБПДоступно
		Или Не ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.ПереводыСБПc2b") Тогда
		Элементы.ГруппаПодключениеКСБПc2b.Видимость = Ложь;
	Иначе
		
		Если Не ЗначениеЗаполнено(НастройкаПодключенияКСБПc2b) Тогда
			НастройкаПодключенияКСБПc2b =
				ПредопределенноеЗначение("Справочник.НастройкиПодключенияКСистемеБыстрыхПлатежей.ПустаяСсылка");
		КонецЕсли;
		
		Элементы.НастройкаПодключенияКСБПc2b.ПараметрыВыбора = ПараметрыВыбораОплаты(
			Перечисления.СпособыОплатыОнлайнЗаказов.СБПc2b);
		
	КонецЕсли;
	
	Если Не ЧтениеНастроекСБПДоступно
		Или Не ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.ПереводыСБПb2b") Тогда
		Элементы.ГруппаПодключениеКСБПb2b.Видимость = Ложь;
	Иначе
		
		Если Не ЗначениеЗаполнено(НастройкаПодключенияКСБПb2b) Тогда
			НастройкаПодключенияКСБПb2b =
				ПредопределенноеЗначение("Справочник.НастройкиПодключенияКСистемеБыстрыхПлатежей.ПустаяСсылка");
		КонецЕсли;
		
		Элементы.НастройкаПодключенияКСБПb2b.ПараметрыВыбора = ПараметрыВыбораОплаты(
			Перечисления.СпособыОплатыОнлайнЗаказов.СБПb2b);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПредставлениеИнтернетЭквайринга()
	
	ЧтениеНастроекИнтернетЭквайрингаДоступно = Ложь;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ИнтернетЭквайринг") Тогда
		МодульИнтернетЭквайрингСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнтернетЭквайрингСлужебный");
		ЧтениеНастроекИнтернетЭквайрингаДоступно = МодульИнтернетЭквайрингСлужебный.ЧтениеНастроекДоступно();
	КонецЕсли;
	
	Элементы.ГруппаПодключениеЭквайринг.Видимость = ЧтениеНастроекИнтернетЭквайрингаДоступно;
	
	Если ЧтениеНастроекИнтернетЭквайрингаДоступно
		И Не ЗначениеЗаполнено(НастройкаПодключенияКИнтернетЭквайрингу)Тогда
		НастройкаПодключенияКИнтернетЭквайрингу =
			ПредопределенноеЗначение("Справочник.НастройкиПодключенияКИнтернетЭквайрингу.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПредставлениеОзонПэй()
	
	Если ЧтениеНастроекПлатежныхСистемДоступно
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй") Тогда
		
		Элементы.ГруппаПодключениеОзонПэй.Видимость = Истина;
		
		Если Не ЗначениеЗаполнено(НастройкаПодключенияКОзонПэй) Тогда
			НастройкаПодключенияКОзонПэй =
				ПредопределенноеЗначение("Справочник.НастройкиПодключенияКПлатежнымСистемам.ПустаяСсылка");
		КонецЕсли;
		
	Иначе
		Элементы.ГруппаПодключениеОзонПэй.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПредставлениеОблачнойФискализации()
	
	ЧтениеНастроекОблачныхКассДоступно = Ложь;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ОблачныеКассы") Тогда
		МодульОблачныеКассы = ОбщегоНазначения.ОбщийМодуль("ОблачныеКассы");
		ЧтениеНастроекОблачныхКассДоступно = МодульОблачныеКассы.ЧтениеНастроекПодключенияДоступно();
	КонецЕсли;
	
	Элементы.ГруппаПодключениеКОблачнойКассе.Видимость = ЧтениеНастроекОблачныхКассДоступно;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеДекорацииПредупреждение()
	
	ЧастиСтрок = Новый Массив;
	ЧастиСтрок.Добавить(НСтр("ru = 'Не удалось обновить данные в сервисе.'"));
	
	Если НастройкаОнлайнЗаказовДоступна Тогда
		ЧастиСтрок.Добавить(" ");
		ЧастиСтрок.Добавить(
			Новый ФорматированнаяСтрока(
				НСтр("ru = 'Повторить отправку'")
				,
				,
				,
				,
				"operation:pageSettings"));
	КонецЕсли;
	
	Элементы.ДекорацияПредупреждение.Заголовок = Новый ФорматированнаяСтрока(ЧастиСтрок);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыВыбораОплаты(СпособОплаты)
	
	Возврат ОнлайнЗаказыСлужебный.ПараметрыВыбораОплаты(СпособОплаты);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииПодключенияИнтернетПоддержки(ДанныеАутентификации, ДопПараметры) Экспорт
	
	Если ДанныеАутентификации <> Неопределено Тогда
		НастроитьВнешнийВидСтраницы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОшибкуСинхронизации(Знач ЗначениеОшибки)
	
	Прочитать();
	Объект.ОшибкаСинхронизации = ЗначениеОшибки;
	ИзменениеАктуальности = Истина;
	Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
